import React from 'react';
import styles from "@/styles/page/official.module.scss";
import Title from "@/components/official/Title";
import Text from "@/components/official/Text";


const PublicOffer = () => {
    return (
        <div className={styles.official}>
            <Title title={"Публичная оферта"}/>
            <Text>
                Настоящее пользовательское соглашение, далее "Соглашение", заключается между Интернет-магазином <span>ЮНИОН</span>,
                имеющим адрес в сети Интернет <span>www.union.shop</span>, далее "Интернет-магазин" или "Сайт", и пользователем услуг
                Интернет-магазина, далее "Покупатель", и определяет условия приобретения товаров через Сайт. <br/><br/>
                1. Основные положения <br/>
                1.1. Настоящее Соглашение заключается между Покупателем и Интернет-магазинов момент оформления
                заказа. <br/>
                1.2. Настоящие Соглашение, а также информация о товаре, представленная на Сайте, являются публичной
                офертой в соответствии со ст.435 и ч.2 ст.437 ГК РФ. <br/>
                1.3. К отношениям между Покупателем и Интернет-магазином применяются положения ГК РФ о продажи товаров
                дистанционным способом (ст.497 Федерального закона РФ от 25.10.2007 N 234-ФЗ), а также Закон РФ «О
                защите прав потребителей» от 07.02.1992 № 2300-1 и иные правовые акты, принятые в соответствии с
                ними. <br/>
                1.4. Покупателем может быть любое физическое или юридическое лицо, способное принять и оплатить
                заказанный им товар в порядке и на условиях, установленных настоящим Соглашением, на территории
                Российской Федерации. <br/>
                1.5. Интернет-магазин оставляет за собой право вносить изменения в настоящее Соглашение. <br/>
                1.6. Настоящее Соглашение должно рассматриваться в том виде, как оно опубликовано на Сайте, и должно
                применяться и толковаться в соответствии с законодательством Российской Федерации. <br/> <br/>

                2. Информация о товаре <br/>
                2.1. Товар представлен на Сайте через фото-образцы, являющиеся собственностью Интернет-магазина. <br/>
                2.2. Каждый фото-образец сопровождается текстовой информацией: ценой и описанием товара, информацией о
                сроках обработки товаров, информацией о предзаказе. <br/>
                2.3. По просьбе Покупателя менеджер Интернет-магазина обязан предоставить посредством электронной почты
                прочую информацию, необходимую и достаточную, с точки зрения Покупателя, для принятия им решения о
                покупке товара. <br/>
                2.4. Указанная на Сайте цена товара может быть изменена Интернет-магазином в одностороннем
                порядке. <br/> <br/>

                3. Порядок приобретения товара <br/>
                3.1. Покупатель вправе оформить заказ на любой товар, представленный на Сайте. Заказ может быть оформлен
                Покупателем следующим способом: самостоятельно на Сайте. <br/>
                3.2. После оформления заказа на e-mail Покупателя отправляется письмо, подтверждающее принятие заказа, с
                указанием номера заказа, наименований выбранных товаров и общей суммы заказа, являющийся неотъемлемой
                частью настоящего Соглашения. <br/>
                3.3 После упаковки и отправки заказа, на e-mail Покупателя отправляется письмо, в котором указан
                трек-номер для отслеживания посылки, а именно “номер посылки”. По данному номеру, на сайте почты России,
                Покупатель имеет возможность отследить посылку. <br/>
                3.4. При отсутствии товара Покупатель вправе заменить его другим товаром либо аннулировать заказ. <br/>
                3.5. Покупатель вправе отказаться от заказанного товара в любое время до его отправки заблаговременно
                поставив в известность об этом Интернет-магазин посредством электронной почты. <br/> <br/>

                4. Доставка и приемка-передача товара <br/>
                4.1. Доставка товара, заказанного в Интернет-магазине, в согласованном количестве и ассортименте,
                осуществляется службой доставки Почта России по территории РФ. <br/>
                Доставка международный отправлений осуществляется службой доставки Почта России до границы, после
                пересечения границы доставка осуществляется местной почтовой службой. <br/>
                4.2. Расходы по доставке товара оплачиваются Покупателем по тарифам, указанным на Сайте. <br/>
                Тариф на международные отправления рассчитывается на сайте и зависят от веса выбранных товаров. <br/>
                4.4. Отправка и доставка заказанного товара производится в оговоренные с Покупателем сроки. Информация о
                сроках обработки и доставки товара указана в описании к товарам. <br/>
                Уважаемый покупатель! Пожалуйста, проверяйте ваш e-mail, указанный при оформлении заказа. Мы очень
                внимательно относимся к статусу вашего заказа и всегда высылаем вам письма в которых описан каждый этап
                формирования заказа. <br/>
                Просим вас быть предельно внимательными приходящим от нас письмам. В день отправки вашего заказа на
                e-mail высылается трек-номер для отслеживания, после чего вы сможете отслеживать свою посылку на сайте
                Почты России в графе “отслеживание”. <br/>
                Бывают случаи, когда посылка лежит 14-30 дней в вашем почтовом отделении, после чего она возвращается
                обратно к нам. <br/>
                <span>Интернет-магазин ЮНИОН</span> не следит за статусом вашей посылки. Когда посылка прибудет к вам по указанному
                адресу, Почта России обязана передать вам извещение на получение посылки. В любом случае, даже если
                извещение к вам не пришло, а вы видите по трек-номеру, что ваша посылка находится в отделении по месту
                жительства, значит вы можете забрать посылку самостоятельно, без извещения. <br/><br/>

                5. Оплата товара <br/>
                5.1. Используя систему <span>(агрегатор)</span>, вы моментально оплатите покупку электронными деньгами популярных
                платежных систем, банковской картой или со счета сотового телефона. Оплатить выставленный счет можно
                позже, через сеть терминалов. Может взиматься комиссия системы <span>(агрегатор)</span>. Заказ будет автоматически
                оплачен и готов к отправке согласно пункта 3.2 <br/>
                5.2. Товар оплачивается только в рублях, при оплате с банковских карт, в другой валюте, платеж будет
                сконвертирован согласно курсу банка, выпустившего карту. <br/> <br/>

                6. Возврат и обмен товара <br/>
                6.1. Покупатель вправе отказаться от товара, если он еще не отправлен. <br/>
                Покупатель вправе отказаться от товара после его получения в течение четырнадцати дней. Возврат товара
                надлежащего качества возможен в случае, если сохранены его товарный вид, потребительские свойства, а
                также документ, подтверждающий факт и условия покупки указанного товара (товарная накладная, кассовый
                чек). В течение этого периода Покупатель обязан известить менеджера магазина посредством электронной
                почты о желании вернуть товар. <br/>
                6.2. При отказе Покупателя от товара до его отправки Интернет-магазин возвращает ему денежную сумму,
                уплаченную за товар. <br/>
                При отказе Покупателя от товара, после его получения, Интернет-магазин возвращает ему денежную сумму,
                уплаченную за товар, за вычетом суммы расходов Интернет-магазина, связанных с доставкой товара
                Покупателю и вывозом товара от Покупателя, не позднее, чем через десять дней со дня предъявления
                Покупателем соответствующего требования. <br/>
                6.3. Товар ненадлежащего качества может быть заменен на аналогичный товар надлежащего качества, либо
                возвращен Продавцу, в данном случае доставку товара оплачивает Продавец. <br/>
                6.4 Покупатель вправе совершить обмен товара после его получения в течение четырнадцати дней. Обмен
                товара надлежащего качества возможен в случае, если сохранены его товарный вид, потребительские
                свойства, а также документ, подтверждающий факт и условия покупки указанного товара (товарная накладная,
                кассовый чек). В течение этого периода Покупатель обязан известить менеджера магазина посредством
                электронной почты о желании обменять товар. Расходы в данном случае оплачивает Покупатель. <br/> <br/>

                7. Прочее <br/>
                7.1. Интернет-магазин оставляет за собой право расширять и сокращать товарное предложение на Сайте,
                регулировать доступ к покупке любых товаров, а также приостанавливать или прекращать продажу любых
                товаров по своему собственному усмотрению. <br/>
                7.2. Интернет-магазин вправе проводить специальные акции. <br/>
                7.3. В соответствии с Федеральным законом «О персональных данных», размещая заказ, Вы даете согласие
                Интернет-магазину на обработку своих персональных данных. <br/>
                7.4. Продавец обязуется соблюдать конфиденциальность в отношении персональных данных Покупателя, а также
                иной информации о Покупателе, ставшей известной Продавцу в связи с исполнением настоящего Соглашения, за
                исключением случаев, когда такая информация:является общедоступной; раскрыта по требованию или с
                разрешения Покупателя; <br/>
                требует раскрытия по основаниям, предусмотренным законодательством, или при поступлении соответствующих
                запросов суда или уполномоченных государственных органов; раскрыта по иным основаниям, предусмотренным
                соглашением Сторон. <br/>
                7.5. Продавец вправе в одностороннем порядке вносить изменения в Соглашение путем публикации изменений
                на Сайте по адресу www.union.shop, если иное не предусмотрено новой редакцией Соглашения. <br/>
                7.6. Соглашение является юридически обязывающим договором между Покупателем и Продавцом содержит правила
                совершения покупок в Интернет-магазине «<span>ЮНИОН</span>». <br/>
                7.7. Данный договор считается заключенным с момента выдачи продавцом покупателю кассового или товарного
                чека, либо иного документа, подтверждающего оплату товара, или с момента получения продавцом сообщения о
                намерении приобрести товар. <br/>
            </Text>
        </div>
    );
};

export default PublicOffer;